views/Mahasiswa/_form.php

    ]
]);?>

  <?= $form->field($model, 'id_prodi')->dropDownList(ArrayHelper::map(Prodi::find()->all(),'id','prodi'),['prompt' => 'Pilih'])->label('Prodi') ?>
---
SELECT * FROM `prodi`